# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко; D, G – 2 очка; B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков.
# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово,
# которое содержит либо только английские, либо только русские буквы.

dict = {1 : ["A", "a", "E", "e", "I", "i", "O", "o", "U", "u", "L", "l", "N", "n", "S", "s", "T", "t", "R", "r",
               "А", "а", "В", "в", "Е", "е", "И", "и", "Н", "н", "О", "о", "Р", "р", "С", "с", "Т", "т"],
        2 : ["D", "d", "G", "g",
                  "Д", "д", "К", "к", "Л", "л", "М", "м", "П", "п", "У", "у"],
        3 : ["B", "b", "C", "c", "M", "m", "P", "p",
                  "Б", "б", "Г", "г", "Ё", "ё", "ь", "Я", "я"],
        4 : ["F", "f", "H", "h", "V", "v", "W", "w", "Y", "y",
                  "Й", "й", "ы"],
        5 : ["K", "k",
                  "Ж", "ж", "З", "з", "Х", "х", "Ц", "ц", "Ч", "ч"],
        8 : ["J", "j", "X", "x",
                  "Ш", "ш", "Э", "э", "Ю", "ю"],
        10 : ["Q", "q", "Z", "z",
                   "Ф", "ф", "Щ", "щ", "ъ"]}
word = input("Введите слово на английском или русском языке: ")
count = 0
for el in range(0,len(word)):
    for k, v in dict.items():
        for i in range(0,len(v)):
            if  word[el] == v[i]:
                count += k
print(f"Ваше слово равно {count} очкам.")